In [4]:
import pandas as pd

In [30]:
df = pd.read_excel('D:\\Py files\\Data Cleaning and Preprocessing\\untidy.xlsx')

In [31]:
df

   id Country       Male     Female
0   0     BAN   85125465   80234678
1   1     IND  623720000  586470000
2   2     PAK  106449322  101314780

In [32]:
copy_untidy = df.copy()
melted_untidy = pd.melt(frame=copy_untidy, id_vars='Country', var_name='Gender', value_name='Total')

In [33]:
melted_untidy

  Country  Gender      Total
0     BAN      id          0
1     IND      id          1
2     PAK      id          2
3     BAN    Male   85125465
4     IND    Male  623720000
5     PAK    Male  106449322
6     BAN  Female   80234678
7     IND  Female  586470000
8     PAK  Female  101314780

In [11]:
df = pd.read_excel('D:\\Py files\\Data Cleaning and Preprocessing\\airquality.xlsx')

In [15]:
melted_airquality = pd.melt(frame=df, id_vars=['Month', 'Day'], var_name='Observation', value_name='Reading')
melted_airquality.head()

   Month  Day Observation  Reading
0      5    1       Ozone     41.0
1      5    2       Ozone     36.0
2      5    3       Ozone     12.0
3      5    4       Ozone     18.0
4      5    5       Ozone      NaN

In [16]:
print(melted_airquality.head())

   Month  Day Observation  Reading
0      5    1       Ozone     41.0
1      5    2       Ozone     36.0
2      5    3       Ozone     12.0
3      5    4       Ozone     18.0
4      5    5       Ozone      NaN

In [34]:
melted_untidy.head()

  Country Gender      Total
0     BAN     id          0
1     IND     id          1
2     PAK     id          2
3     BAN   Male   85125465
4     IND   Male  623720000

In [35]:
pivoted_country = melted_untidy.pivot(index = 'Country', columns = 'Gender', values = 'Total')

In [36]:
pivoted_country.head()

Gender      Female       Male  id
Country
BAN       80234678   85125465   0
IND      586470000  623720000   1
PAK      101314780  106449322   2

In [37]:
pivoted_air = melted_airquality.pivot_table(index=['Month', 'Day'], columns='Observation', values='Reading')

In [22]:
pivoted_air

Observation  Ozone  Solar  Temp  Wind
Month Day
5     1       41.0  190.0  67.0   7.4
      2       36.0  118.0  72.0   8.0
      3       12.0  149.0  74.0  12.6
      4       18.0  313.0  62.0  11.5
      5        NaN    NaN  56.0  14.3

In [38]:
melted_untidy = melted_untidy.append({'Country' : 'BAN', 'Gender' : 'Female', 'Total' : '696969696'}, ignore_index=True)

In [39]:
melted_untidy

  Country  Gender      Total
0     BAN      id          0
1     IND      id          1
2     PAK      id          2
3     BAN    Male   85125465
4     IND    Male  623720000
5     PAK    Male  106449322
6     BAN  Female   80234678
7     IND  Female  586470000
8     PAK  Female  101314780
9     BAN  Female  696969696

In [43]:
import numpy as np

new_melted_untidy = melted_untidy.pivot_table(index = 'Country', columns='Gender', values='Total', aggfunc=np.mean)

In [44]:
new_melted_untidy.head()

Empty DataFrame
Columns: []
Index: [BAN, IND, PAK]